"""Знайти суму парних елементів масиву цілих чисел. Розмірність масиву -
20. Заповнення масиву здійснити випадковими числами від 100 до 200.
Мельник Д.В. 122А
"""
import random

massive = [random.randint(100, 200) for i in range(20)]  # Створюємо масив генератором списку
print(massive)
summa = 0
for i in massive:  # Проходим по елементам масиву
    if i % 2 == 0:  # Якщо остача при діленні на 2 буде 0 то число парне
        summa += i  # Шукаємо суму таких чисел
print(f'Cума парних елементів масиву: {summa}')