"""Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
Мельник Д.В. 122А
"""
import random

cratni = []  # Сюди будемо записувати числа кратні 7
numbers = [random.randint(10, 50) for i in range(15)]  # Створюємо масив генератором списків
print(numbers)
mult = 1
for i in range(len(numbers)):  # Проходимся по елементам масиву
    if numbers[i] % 7 == 0:  # Якщо число без остачі ділиться на 7,то воно кратне 7
        mult *= numbers[i]
        cratni.append(numbers[i])
if len(cratni) >= 1:  # Якщо більше 1 числа, то вони будуть перемножатись
    print(f'Добуток елементів масиву цілих чисел, які кратні 7: {mult}')
else:
    print('Немає чисел кратних 7, добуток: 0')