"""Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в
один рядок через кому. Отримайте для масиву середнє арифметичне.
Мельник Дмитро 122А
"""
massive = [int(input('Введіть елемент: ')) for i in range(5)]  #Генератор списку для створення масиву і введення елементів
s = 0
for i in range(5):   #Реалізація середнього арифметичного
    s += massive[i]
print(f'Середнє арифметичне {s/5}')
print(','.join(str(i) for i in massive))   #Виводимо елементи через коми через join і перетворюємо числа в стрічки щоб він працював