"""Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
Мельник Дмитро 122А
"""
low_numbers = []
massive = [int(input('Введіть число: ')) for i in range(10)]
print(massive)
mult = 1
for i in range(len(massive)):
    if massive[i]<0:
        mult *= massive[i]
        low_numbers.append(massive[i])  # Додаємо число в список менших 0
if len(low_numbers) >= 1:  # Якщо більше 1 числа, то вони будуть перемножатись,якщо одне то виводимо число
    print(f'Добуток елементів масиву цілих чисел, які менше 0: {mult}')
else:
    print('Немає чисел менше 0, добуток: 0')
