"""Створіть масив А [1..12] за допомогою генератора випадкових чисел з
елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
масиву числом 0.
Мельник Д.В.
"""
import random

massive = [random.randint(-20, 10) for i in range(12)]  # Генератор списку для ініцалізації масиву та його елементів
print(massive)
for i in range(len(massive)):  # К-сть ітерації = довжині масиву
    if massive[i] < 0:  # Звертаємось по індексу,щоб отримати елемент масиву
        massive[i] = 0  # Якщо він менше 0 то заміняємо його на 0
print(massive)
