"""Підрахуйте кількість елементів одновимірного масиву, які збігаються зі
своїм номером і при цьому кратні 3.
Мельник Д.В.122А
"""
# Брав ті які збігаються за своїм індексом, а не номером,бо не зрозумів, що мається на увазі під номером
import random

massive = [random.randint(-10, 10) for i in range(10)]  # Створюємо масив генератором списку
print(massive)
count = 0
for i in range(len(massive)):
    if massive[i] == i and massive[i] % 3 == 0:  # Перевіряємо умову
        count += 1  # Додаємо +1 до лічильника
print(f'кількість елементів одновимірного масиву, які збігаються зі своїм номером і при цьому кратні 3: {count}')
