"""
Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання.
Мельник Д.В. 122А
"""
import random

nice_water = 0  # Наш лічильник
info_temp = [random.randint(0, 25) for i in range(10)]  # Погода незрозуміла тому температура води від 0 до 25, а декада це 10
print(info_temp)
for i in range(len(info_temp)):  # Проходимо по елементам масиву
    if info_temp[i] >= 15:  # Припустимо що придатна для купання вода має бути більше 15 градусів тепла
        nice_water += 1  # Якщо умова працює то додаємо до лічильника +1
print(f'Кількість придатних днів: {nice_water}')
