"""Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.
Мельник Д.В. 122А
"""
vidstani = []
h = 0
v = 0  # Початкової швидкості тіла в нас немає
g = 9.81  # Прискорення вільного падіння
for t in range(1,11):  # Починаємо з 1 секунди і до 10
    h = v * t + g * (t ** 2 / 2)  # Рахуємо за формулою відстань для кожної секунди
    vidstani.append(h)  # На кожній ітерації додаємо нову відстань з проміжками часу в масив
print(vidstani)

