"""Дан одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних
чисел в ньому.
Мельник Д.В. 122А
"""
import random

massive = [random.randint(1,8) for i in range(10)]  # Створюємо масив генератором списку
print(massive)

count_set = set()  # Створюємо пусту множину
for i in range(len(massive)):
    count_set.add(massive[i])  # Додаємо у множину елементи списку(через властивості множин вони не будуть повторюватись)
print(f'Різних чисел у масиві: {len(count_set)}')  # Довжина множини і буде к-стю унікальних елементів
