"""Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 5 до 500.
Мельник Д.В. 122А
"""
import random

cratni = []
massive = [random.randint(5, 500) for i in range(10)]  # Створюємо масив генератором списку
print(massive)
mult = 1
for i in massive:  # Проходим по елементам масиву
    if i % 3 == 0 and i % 9 == 0:  # Перевіряємо нашу умову
        mult *= i  # Шукаємо добуток таких чисел
        cratni.append(i)
if len(cratni) == 0:
    print('Немає елементів масиву, кратних 3 і 9')
if len(cratni) >= 1:
    print(f'добуток елементів масиву, кратних 3 і 9: {mult}')