"""
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Мельник Д.В.
"""
import random

neg_el = 0  # Тут ми будемо зберігати к-сть негативних елементів
massive = [random.randint(-10, 10) for i in range(8)]  # Генератор списку для ініцалізації масиву та його елементів
print(massive)
for i in massive:  # Проходимо по елементам масиву,якщо зустічається від'ємний,то додаємо +1 до нашої змінної
    if i < 0:
        neg_el += 1
print(f"Від'ємних елементів: {neg_el}")
