"""Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
Мельник Д.В. 122А
"""

count = 0  # Лічильник
sales = ['potatoes', 'movies', 'onions','carrots','potatoes','movies']  # Таблиця
final_sales = []  # Відфільтрована таблиця
for i in range(len(sales)):
    count = sales.count(sales[i])  # Рахуємо кількість входжень кожного елементу
    if count <= 1:
        final_sales.append(sales[i])  # Якщо елемент унікальний то додаємо його в відфільтровану таблицю
        count = 0  # Обнуляємо лічильник
print(final_sales)
