"""Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
числами від 500 до 1000.
Мельник Д.В. 122А
"""
import random

massive = [random.randint(500, 1000) for i in range(30)]  # Створюємо масив генератором списку
print(massive)
summa = 0
for i in massive:  # Проходим по елементам масиву
    if i % 5 == 0 and i % 8 == 0:  # Перевіряємо нашу умову
        summa += i  # Шукаємо суму таких чисел
print(f'Сума елементів масиву, які діляться на 5 і на 8 одночасно: {summa}')