"""Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
яка містить довжини опор, які встановлюються через кожні R / 5 м.
Мельник Д.В. 122А
"""

import math

radius = float(input('Введіть радіус: '))  # Трикутник буде прямокутний, бо він утворений точкою на колі і кінцями діаметрів
array = radius / 5  # скільки метрів зайнято опорами
count = 0  # кількість опор
i = 0  # індекс опори
while count < (2 * radius - array):  # не виходимо за межі даху
    count += array
    i += 1
    print(f'Висота {i} опори буде: {math.sqrt(count * (2 * radius - count))} метрів')