"""Знайти суму всіх елементів масиву дійсних чисел, більших за задане
число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами
від 50 до 100.
Мельник Д.В. 122А
"""
import random

number = float(input('Введіть число: '))
massive = [random.uniform(50, 100) for i in range(20)]  # Створюємо масив генератором списку
print(massive)
summa = 0
for i in massive:  # Проходим по елементам масиву
    if i > number:  # Перевіряємо нашу умову
        summa += i  # Шукаємо суму таких чисел
print(f'Сума всіх елементів масиву дійсних чисел: {summa}')