"""Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Мельник Д.В. 122А
"""
massive_t = [int(input('Введіть температуру: ')) for i in range(6)]  # Генератор списку
print(massive_t)
summa = 0
for i in massive_t:  # Проходим по елементам масиву
    summa += i  # Шукаємо суму
print(f'Середнє арифметичне: {summa/6}')
print(f'Максимальне значення: {max(massive_t)}')  # Максимальне значення
print(f'Мінімальне значення: {min(massive_t)}')  # Мінімальне значення
