"""
Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
екран значення коріння і квадратів кожного з елементів масиву.
Мельник Д.В. 122А
"""
import math  # Імпортуєм для функції кореня

massive_x = [int(input('Введіть елемент')) for x in range(5)]  # Генератор масиву для ініціалізації масиву
for i in range(len(massive_x)):
    print(f'Корінь із {massive_x[i]}: {math.sqrt(massive_x[i])}')  # Застосовуємо sqrt Для кореню.Звертаємось по ідексу щоб пройти кожен елемент
    print(f'Квадрат {massive_x[i]}: {massive_x[i]**2}')
