"""Знайти добуток всіх елементів масиву дійсних чисел, менших заданого
числа. Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами
від 50 до 100.
Мельник Дмитро 122А
"""
import random

number = float(input('Введіть число: '))
massive = [random.uniform(50, 100) for i in range(10)]  # Створюємо масив генератором списку
print(massive)
mult = 1
for i in massive:  # Проходим по елементам масиву
    if i > number:  # Перевіряємо нашу умову
        mult *= i  # Шукаємо добуток таких чисел
print(f'Добуток всіх елементів масиву дійсних чисел, менших заданого числа.: {mult}')