"""
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.
Мельник Д.В. 122А
"""
start_temp = float(input('Введіть початкову температуру: ')) # Задаємо початкові значення
minus_temp = float(input('Введіть число її падіння: '))
for i in range(8,21):  # Беремо кінецеве значення циклу на 1 більше щоб було з 8 до 20
    temp = start_temp - minus_temp  # Визначаємо температуру для кожної години
    start_temp = temp  # Зберігаємо її значення щоб на наступній ітерації відняти від неї її спад
    if temp < 0:  # Якщо температура менше 0,то виводимо о якій годині зафіксували
        print(f'Вперше зафіксовано о {i} годині')
        break  # Перериваємо цикл бо ми знайшли що хотіли
    elif i == 20 and temp >= 0:
        print(f"Температура не ставала від'ємною")  # Якщо на останній годині температура додатня.То пишемо що вона не ставала від'ємною
